kossnikita/at32f4xx-pac/src/at32f435/at32f435.svd
        <register>
          <name>BK1TMGWR2</name>
          <displayName>BK1TMGWR2</displayName>
          <description>SRAM/NOR-Flash write timing registers
          2</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR3</name>
          <displayName>BK1TMGWR3</displayName>
          <description>SRAM/NOR-Flash write timing registers
          3</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BK1TMGWR4</name>
          <displayName>BK1TMGWR4</displayName>
          <description>SRAM/NOR-Flash write timing registers
          4</description>
          <addressOffset>0x11C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>ASYNCM</name>
              <description>Asynchronous mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSLAT</name>
              <description>Bus latency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DTST</name>
              <description>Asynchronous data setup time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>ADDRHT</name>
              <description>Address-hold time</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ADDRST</name>
              <description>Address setup time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <displayName>CTRL1</displayName>
          <description>SDRAM Control Register 1</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000002D0</resetValue>
          <fields>
            <field>
              <name>CA</name>
              <description>Number of column address
              bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>Number of row address bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DB</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INBK</name>
              <description>Number of internal banks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS latency</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WRP</name>
              <description>Write protection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock division configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BSTR</name>
              <description>Burst read</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD</name>
              <description>Read delay</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL2</name>
          <displayName>CTRL2</displayName>
          <description>SDRAM Control Register 2</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000002D0</resetValue>
          <fields>
            <field>
              <name>CA</name>
              <description>Number of column address
              bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>Number of row address bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DB</name>
              <description>Memory data bus width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INBK</name>
              <description>Number of internal banks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAS</name>
              <description>CAS latency</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>WRP</name>
              <description>Write protection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Clock division configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BSTR</name>
              <description>Burst read</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RD</name>
              <description>Read pipe</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1</name>
          <displayName>TM1</displayName>
          <description>SDRAM Timing register 1</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>Mode register program to active delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TXSR</name>
              <description>Exit Self-refresh to active delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>Self refresh time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Refresh to active delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TWR</name>
              <description>Write Recovery delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>Precharge to active delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row active to Read/Write delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TM2</name>
          <displayName>TM2</displayName>
          <description>SDRAM Timing register 2</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0FFFFFFF</resetValue>
          <fields>
            <field>
              <name>TMRD</name>
              <description>Mode register program to active delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TXSR</name>
              <description>Exit Self-refresh to active delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRAS</name>
              <description>Self refresh time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRC</name>
              <description>Refresh to active delay</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TWR</name>
              <description>Write Recovery delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRP</name>
              <description>Precharge to active delay</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRCD</name>
              <description>Row active to Read/Write delay</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <displayName>CMD</displayName>
          <description>SDRAM Command Mode register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>SDRAM Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK2</name>
              <description>SDRAM Bank 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1</name>
              <description>SDRAM Bank 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ART</name>
              <description>Auto-refresh times</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRD</name>
              <description>Mode register data</description>
              <bitOffset>9</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCNT</name>
          <displayName>RCNT</displayName>
          <description>SDRAM Refresh Timer register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERRC</name>
              <description>error flag clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC</name>
              <description>Refresh Count</description>
              <bitOffset>1</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERIEN</name>
              <description>error Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <displayName>STS</displayName>
          <description>SDRAM Status register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERR</name>
              <description>error flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK1STS</name>
              <description>Bank 1 Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BK2STS</name>
              <description>Bank 2 Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT1</name>
          <displayName>EXT1</displayName>
          <description>externl timeing register 1</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT2</name>
          <displayName>EXT2</displayName>
          <description>externl timeing register 2</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT3</name>
          <displayName>EXT3</displayName>
          <description>externl timeing register 3</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT4</name>
          <displayName>EXT4</displayName>
          <description>externl timeing register 4</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
